export const addressArr = [
    { value: '온라인', label: '온라인' },
    { value: '전국', label: '전국' },
    {
        label: '서울',
        value: '서울',
        options: [
            { value: '전체', label: '' },
            { value: '강남구', label: '강남구' },
            { value: '강동구', label: '강동구' },
            { value: '강북구', label: '강북구' },
            { value: '강서구', label: '강서구' },
            { value: '관악구', label: '관악구' },
            { value: '광진구', label: '광진구' },
            { value: '구로구', label: '구로구' },
            { value: '금천구', label: '금천구' },
            { value: '노원구', label: '노원구' },
            { value: '도봉구', label: '도봉구' },
            { value: '동대문구', label: '동대문구' },
            { value: '동작구', label: '동작구' },
            { value: '마포구', label: '마포구' },
            { value: '서대문구', label: '서대문구' },
            { value: '서초구', label: '서초구' },
            { value: '성동구', label: '성동구' },
            { value: '성북구', label: '성북구' },
            { value: '송파구', label: '송파구' },
            { value: '양천구', label: '양천구' },
            { value: '영등포구', label: '영등포구' },
            { value: '용산구', label: '용산구' },
            { value: '은평구', label: '은평구' },
            { value: '종로구', label: '종로구' },
            { value: '중구', label: '중구' },
            { value: '중랑구', label: '중랑구' },
        ]
    },
    // {
    //     부산: [
    //         '전체', '강서구', '금정구', '기장군', '남구', '동구',
    //         '동래구', '부산진구', '북구', '사상구', '사하구', '서구',
    //         '수영구', '연제구', '영도구', '중구', '해운대구',
    //     ]
    // },
    // {
    //     대구: [
    //         '전체', '남구', '달서구', '달성군', '동구', '북구',
    //         '서구', '수성구', '중구',
    //     ]
    // },
    // {
    //     인천: [
    //         '전체', '강화군', '계양구', '미추홀구', '남동구', '동구',
    //         '부평구', '서구', '연수구', '옹진구', '중구',
    //     ]
    // },
    // {
    //     광주: [
    //         '전체', '광산구', '남구', '동구', '북구', '서구', 
    //     ]
    // },
    // {
    //     대전: [
    //         '전체', '대덕구', '동구', '서구', '유성구', '중구', 
    //     ]
    // },
    // {
    //     울산: [
    //         '전체', '남구', '동구', '북구', '울주군', '중구', 
    //     ]
    // },
    // {
    //     세종: ['전체',]
    // },
    // {
    //     경기: [
    //         '전체', '가평군', '고양시 덕양구', '고양시 일산동구', '고양시 일산서구', '과천시',
    //         '광명시', '광주시', '구리시', '군포시', '김포시', '남양주시', 
    //     ]
    // },
    // {
    //     강원: [
    //         '전체', 
    //     ]
    // },
    // {
    //     충북: [
    //         '전체', 
    //     ]
    // },
    // {
    //     충남: [
    //         '전체', 
    //     ]   
    // },
    // {
    //     전북: [
    //         '전체', 
    //     ]
    // },
    // {
    //     전남: [
    //         '전체', 
    //     ]
    // },
    // {
    //     경북: [
    //         '전체', 
    //     ]
    // },
    // {
    //     경남: [
    //         '전체', 
    //     ]
    // },
    // {
    //     제주: [
    //         '전체', 
    //     ]
    // },
]