export const addressArr = [
    {
        온라인: []
    },
    {
        전국: ['전체',]
    },
    {
        서울: [
            '전체', '강남구', '강동구', '강북구', '강서구', '관악구', 
            '광진구', '구로구', '금천구', '노원구', '도봉구', '동대문구', 
            '동작구', '마포구', '서대문구', '서초구', '성동구', '성북구', 
            '송파구', '양천구', '영등포구', '용산구', '은평구', '종로구', 
            '중구', '중랑구',
        ]
    },
    {
        부산: [
            '전체', '강서구', '금정구', '기장군', '남구', '동구',
            '동래구', '부산진구', '북구', '사상구', '사하구', '서구',
            '수영구', '연제구', '영도구', '중구', '해운대구',
        ]
    },
    {
        대구: [
            '전체', '남구', '달서구', '달성군', '동구', '북구',
            '서구', '수성구', '중구',
        ]
    },
    {
        인천: [
            '전체', '강화군', '계양구', '미추홀구', '남동구', '동구',
            '부평구', '서구', '연수구', '옹진구', '중구',
        ]
    },
    {
        광주: [
            '전체', '광산구', '남구', '동구', '북구', '서구', 
        ]
    },
    {
        대전: [
            '전체', '대덕구', '동구', '서구', '유성구', '중구', 
        ]
    },
    {
        울산: [
            '전체', '남구', '동구', '북구', '울주군', '중구', 
        ]
    },
    {
        세종: ['전체',]
    },
    {
        경기: [
            '전체', '가평군', '고양시 덕양구', '고양시 일산동구', '고양시 일산서구', '과천시',
            '광명시', '광주시', '구리시', '군포시', '김포시', '남양주시', 
        ]
    },
    {
        강원: [
            '전체', 
        ]
    },
    {
        충북: [
            '전체', 
        ]
    },
    {
        충남: [
            '전체', 
        ]   
    },
    {
        전북: [
            '전체', 
        ]
    },
    {
        전남: [
            '전체', 
        ]
    },
    {
        경북: [
            '전체', 
        ]
    },
    {
        경남: [
            '전체', 
        ]
    },
    {
        제주: [
            '전체', 
        ]
    },
]