export interface AddressData {
    province: string;
    districts: string[];
}

export const addressArr = [
    { province: '온라인', districts: [] },
    { province: '전국', districts: [] },
    {
        province: '서울',
        districts: [
            '전체', '강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구',
            '금천구', '노원구', '도봉구', '동대문구', '동작구', '마포구', '서대문구',
            '서초구', '성동구', '성북구', '송파구', '양천구', '영등포구', '용산구',
            '은평구', '종로구', '중구', '중랑구',
        ]
    },
    {
        province: '부산',
        districts: [
            '전체', '강서구', '금정구', '기장군', '남구', '동구',
            '동래구', '부산진구', '북구', '사상구', '사하구', '서구',
            '수영구', '연제구', '영도구', '중구', '해운대구',
        ]
    },
    {
        province: '대구',
        districts: [
            '전체', '남구', '달서구', '달성군', '동구', '북구',
            '서구', '수성구', '중구',
        ]
    },
    {
        province: '인천',
        districts: [
            '전체', '강화군', '계양구', '미추홀구', '남동구', '동구',
            '부평구', '서구', '연수구', '옹진구', '중구',
        ]
    },
    {
        province: '광주',
        districts: ['전체', '광산구', '남구', '동구', '북구', '서구',]
    },
    {
        province: '대전',
        districts: ['전체', '대덕구', '동구', '서구', '유성구', '중구', ]
    },
    {
        province: '울산',
        districts: ['전체', '남구', '동구', '북구', '울주군', '중구',]
    },
    {
        province: '세종',
        districts: ['전체',]
    },
    {
        province: '경기',
        districts: [
            '전체', '가평군', '고양시 덕양구', '고양시 일산동구', '고양시 일산서구', '과천시',
            '광명시', '광주시', '구리시', '군포시', '김포시', '남양주시', 
        ]
    },
    {
        province: '강원',
        districts: [
            '전체', '강릉시', '동해시', '삼척시', '양구군', '양양군', '원주시', 
            '인제군', '철원군', '춘천시', '평창군', '홍천군', '횡성군',  
        ]
    },
    {
        province: '충북',
        districts: [
            '전체', '괴산군', '보은군', '영동군', '음성군', '제천시',
            '진천군', '청원군', '천주시 상당구', '천주시 서원구', '천주시 흥덕구', '충주시',
        ]
    },
    {
        province: '충남',
        districts: [
            '전체', '계륭시', '금산군', '논산시', '보령시', '부여군', '서천군',
            '아산시', '예산군', '천안시', '천안시 서북구', '청양군', '홍성군',
        ]
    },
    {
        province: '전북',
        districts: [
            '전체', '고창군', '기제시', '남원시', '부안군', '순창군',
            '익산시', '임실군', '전주시', '전주시 덕진구', '정읍시', '전안군', 
        ]
    },
    {
        province: '전남',
        districts: [
            '전체', '강진군', '곡성군', '광양시', '나주시', '담양군',
            '무안군', '보성군', '신안군', '여수시', '영암군', '완도군',
            '장흥군', '진도군', '해남군', '화순군', 
        ]
    },
    {
        province: '경북',
        districts: [
            '전체', '경산시', '고령군', '구미시', '김천시', '문경시',
            '산주시', '성주군', '영덕군', '영양군', '영천시', '예천군',
            '울진군', '의선군', '청송군', '칠곡군', '포항시 남구', '포항기 북구', 
        ]
    },
    {
        province: '경남',
        districts: [
            '전체', '거제시', '고성군', '김해시', '밀양시', '사천시',
            '양산시', '의령군', '창녕군', '창원시', '창원시 마산회원구', '차원시 성산구',
            '창원시 진해구', '토영시', '함안군', '힘양군', 
        ]
    },
    {
        province: '제주',
        districts: [
            '전체', '제주시', '서귀포시',
        ]
    },
]